{
  "controls": [
    {
      "id": "A.5.1",
      "number": "A.5.1",
      "title": "Policies for information security",
      "domain": "Governance",
      "description": "A set of policies for information security shall be defined, approved by management, published and communicated to employees and relevant external parties.",
      "story": "Imagine you're the CEO of a growing tech company. Your board asks: 'Do we have written security policies?' You confidently hand them a comprehensive policy document that covers everything from password management to incident response. This is A.5.1 - your foundation of security governance.",
      "implementationGuidance": "Develop comprehensive security policies covering all aspects of information security, ensure management approval, publish them in accessible locations, and regularly review and update them.",
      "evidence": ["Security policy documents", "Policy approval records", "Communication records", "Training records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.5.2",
      "number": "A.5.2",
      "title": "Review of the policies for information security",
      "domain": "Governance",
      "description": "The policies for information security shall be reviewed at planned intervals or if significant changes occur to ensure their continuing suitability, adequacy and effectiveness.",
      "story": "Your security policies aren't set in stone. As your company grows and threats evolve, you need to regularly review and update them. This is like a car's annual inspection - it ensures everything still works properly.",
      "implementationGuidance": "Establish a review schedule (typically annually), document review results, update policies based on changes in business, technology, or threats, and maintain version control.",
      "evidence": ["Review schedule", "Review meeting minutes", "Updated policy versions", "Change logs"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.6.1",
      "number": "A.6.1",
      "title": "Information security roles and responsibilities",
      "domain": "Governance",
      "description": "All information security responsibilities shall be defined and allocated.",
      "story": "In a security incident, everyone can't be in charge. Someone needs to be the incident commander, someone handles communications, someone manages technical response. A.6.1 ensures everyone knows their role.",
      "implementationGuidance": "Define clear roles and responsibilities for all information security functions, assign qualified personnel, document in job descriptions, and ensure proper segregation of duties.",
      "evidence": ["Job descriptions", "Organization chart", "Responsibility matrix", "Training records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.6.2",
      "number": "A.6.2",
      "title": "Segregation of duties",
      "domain": "Governance",
      "description": "Conflicting duties and areas of responsibility shall be segregated to reduce opportunities for unauthorized or unintentional modification or misuse of the organization's assets.",
      "story": "You wouldn't let the same person approve invoices and write checks. In cybersecurity, you can't let the same person design, implement, and audit security controls. This separation prevents fraud and errors.",
      "implementationGuidance": "Identify conflicting duties, separate incompatible functions, implement approval processes, and regularly review and monitor segregation effectiveness.",
      "evidence": ["Role definitions", "Authorization matrices", "Approval workflows", "Audit logs"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.7.1",
      "number": "A.7.1",
      "title": "Background verification",
      "domain": "Risk Management",
      "description": "Background verification checks on all candidates for employment, contractors and third party users shall be carried out in accordance with relevant laws, regulations and ethics and proportional to the business requirements, the classification of the information to be accessed and the perceived risks.",
      "story": "Before hiring a security guard, you check their background. Before giving someone access to your most sensitive data, you should do the same. This is your first line of defense against insider threats.",
      "implementationGuidance": "Define verification requirements based on role sensitivity, conduct checks in compliance with local laws, verify qualifications and references, and document all checks.",
      "evidence": ["Verification procedures", "Background check records", "Reference checks", "Employment contracts"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.7.2",
      "number": "A.7.2",
      "title": "Terms and conditions of employment",
      "domain": "Risk Management",
      "description": "The contractual agreements with employees and contractors shall state their and the organization's responsibilities for information security.",
      "story": "When someone joins your team, they need to know the rules. Your employment contracts should clearly state: 'You will protect company data, you won't share passwords, you'll report security incidents.' This sets expectations from day one.",
      "implementationGuidance": "Include security clauses in employment contracts, define acceptable use policies, specify confidentiality obligations, and include termination procedures.",
      "evidence": ["Employment contracts", "Acceptable use policies", "Confidentiality agreements", "Termination procedures"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.7.3",
      "number": "A.7.3",
      "title": "Information security awareness, education and training",
      "domain": "Risk Management",
      "description": "All employees of the organization and, where relevant, contractors and third party users shall receive appropriate awareness education and training and regular updates in organizational policies and procedures, as relevant for their job function.",
      "story": "Your security is only as strong as your weakest link. Regular training turns every employee into a security sensor. They'll spot phishing emails, report suspicious activity, and follow proper procedures.",
      "implementationGuidance": "Develop training programs, conduct regular security awareness sessions, provide role-specific training, track completion, and measure effectiveness.",
      "evidence": ["Training materials", "Training records", "Completion certificates", "Assessment results"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.8.1",
      "number": "A.8.1",
      "title": "Inventory of assets",
      "domain": "Operations",
      "description": "Assets associated with information and information processing facilities shall be identified and an inventory of these assets shall be drawn up and maintained.",
      "story": "You can't protect what you don't know you have. This control asks: 'What assets do we have? Where are they? Who's responsible?' It's like a home inventory for insurance - essential for knowing what you need to protect.",
      "implementationGuidance": "Identify all information assets, maintain an asset register, assign asset owners, track asset lifecycle, and regularly update the inventory.",
      "evidence": ["Asset inventory", "Asset register", "Asset ownership records", "Lifecycle management records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.8.2",
      "number": "A.8.2",
      "title": "Ownership of assets",
      "domain": "Operations",
      "description": "Assets maintained in the inventory shall be owned.",
      "story": "Every asset needs an owner - someone who's responsible for its security. If a server gets compromised, you need to know who to call. This accountability drives proper security management.",
      "implementationGuidance": "Assign ownership for all assets, document in asset register, ensure owners understand responsibilities, and review ownership regularly.",
      "evidence": ["Asset ownership matrix", "Owner contact information", "Responsibility documentation", "Review records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.8.3",
      "number": "A.8.3",
      "title": "Acceptable use of assets",
      "domain": "Operations",
      "description": "Rules for the acceptable use of information and of assets associated with information and information processing facilities shall be identified, documented and implemented.",
      "story": "Your company laptop isn't for gaming or torrenting. Your email isn't for personal shopping. Acceptable use policies set clear boundaries for how company resources can be used.",
      "implementationGuidance": "Define acceptable use rules, communicate to all users, implement monitoring where appropriate, and enforce consistently.",
      "evidence": ["Acceptable use policy", "User acknowledgments", "Monitoring reports", "Violation records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.9.1",
      "number": "A.9.1",
      "title": "Access control policy",
      "domain": "Operations",
      "description": "An access control policy shall be established, documented and reviewed based on business and information security requirements.",
      "story": "Who gets access to what? This fundamental question is answered by your access control policy. It's the gatekeeper that ensures people only see what they need to do their jobs.",
      "implementationGuidance": "Define access control principles, establish access levels, document procedures, implement least privilege principle, and review regularly.",
      "evidence": ["Access control policy", "Access control procedures", "Access level definitions", "Review records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.9.2",
      "number": "A.9.2",
      "title": "User access management",
      "domain": "Operations",
      "description": "User access management shall be implemented through formal procedures to control allocation of access rights.",
      "story": "When someone joins your company, they need accounts. When they leave, those accounts need to be disabled. This control ensures proper user lifecycle management - the foundation of access security.",
      "implementationGuidance": "Establish user registration procedures, implement approval workflows, use unique user IDs, and maintain access records.",
      "evidence": ["User registration procedures", "Approval workflows", "User access records", "Access review records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.9.3",
      "number": "A.9.3",
      "title": "User responsibilities",
      "domain": "Operations",
      "description": "Users shall be required to follow good security practices in the selection and use of passwords.",
      "story": "Your password shouldn't be 'password123'. This control ensures users choose strong passwords, keep them secret, and change them regularly. It's basic hygiene, but essential.",
      "implementationGuidance": "Define password requirements, provide user guidance, implement password management tools, and monitor compliance.",
      "evidence": ["Password policy", "User guidance", "Password management tools", "Compliance reports"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.9.4",
      "number": "A.9.4",
      "title": "System and application access control",
      "domain": "Operations",
      "description": "Access to systems and applications shall be controlled by a secure log-on procedure.",
      "story": "Your login screen is your front door. This control ensures it's locked properly with multi-factor authentication, session management, and secure protocols.",
      "implementationGuidance": "Implement secure authentication mechanisms, use strong passwords or MFA, manage sessions securely, and log all access attempts.",
      "evidence": ["Authentication procedures", "MFA implementation", "Session management", "Access logs"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.10.1",
      "number": "A.10.1",
      "title": "Cryptographic controls",
      "domain": "Operations",
      "description": "A policy on the use of cryptographic controls for protection of information shall be developed and implemented.",
      "story": "When you send sensitive data over the internet, it needs to be encrypted. This control ensures you're using proper encryption for data in transit and at rest.",
      "implementationGuidance": "Define cryptographic requirements, select appropriate algorithms, manage encryption keys securely, and implement encryption for sensitive data.",
      "evidence": ["Cryptographic policy", "Algorithm selection", "Key management procedures", "Encryption implementation"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.11.1",
      "number": "A.11.1",
      "title": "Physical and environmental security",
      "domain": "Operations",
      "description": "Physical security perimeters shall be defined and used to protect areas that contain information and information processing facilities.",
      "story": "Your data center needs locked doors, security guards, and access controls. This is your physical perimeter - keeping unauthorized people away from your servers.",
      "implementationGuidance": "Define security perimeters, implement access controls, use security barriers, monitor entry points, and maintain visitor logs.",
      "evidence": ["Perimeter definitions", "Access control systems", "Security barriers", "Visitor logs"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.11.2",
      "number": "A.11.2",
      "title": "Physical entry controls",
      "domain": "Operations",
      "description": "Physical entry controls shall be designed and applied.",
      "story": "Not everyone can walk into your server room. This control ensures only authorized personnel can access sensitive areas, with proper authentication and logging.",
      "implementationGuidance": "Implement entry controls, use authentication mechanisms, maintain entry logs, and review access regularly.",
      "evidence": ["Entry control procedures", "Authentication mechanisms", "Entry logs", "Review records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.12.1",
      "number": "A.12.1",
      "title": "Operational procedures and responsibilities",
      "domain": "Operations",
      "description": "Operating procedures shall be documented and made available to all users who need them.",
      "story": "How do you deploy code to production? How do you handle a security incident? Documented procedures ensure consistency and reduce errors.",
      "implementationGuidance": "Document all operational procedures, make them accessible, train staff, review regularly, and maintain version control.",
      "evidence": ["Operational procedures", "Procedure documentation", "Training records", "Review records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.12.2",
      "number": "A.12.2",
      "title": "Change management",
      "domain": "Operations",
      "description": "Changes to information processing facilities and systems shall be controlled.",
      "story": "Every change to your systems needs to be planned, tested, approved, and documented. This prevents 'oops' moments that break production.",
      "implementationGuidance": "Establish change management procedures, require approvals, test changes, document thoroughly, and maintain rollback plans.",
      "evidence": ["Change management procedures", "Change requests", "Approval records", "Testing records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.12.3",
      "number": "A.12.3",
      "title": "Capacity management",
      "domain": "Operations",
      "description": "The use of resources shall be monitored, tuned and projections made of future capacity requirements to ensure the required system performance.",
      "story": "Your systems need to handle growth. This control ensures you're monitoring capacity, planning for growth, and preventing performance issues.",
      "implementationGuidance": "Monitor resource usage, establish capacity thresholds, plan for growth, optimize performance, and maintain capacity plans.",
      "evidence": ["Capacity monitoring", "Usage reports", "Capacity plans", "Optimization records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.13.1",
      "number": "A.13.1",
      "title": "Network controls",
      "domain": "Operations",
      "description": "Networks shall be managed and controlled to protect information in systems and applications.",
      "story": "Your network is the highway for your data. This control ensures it's properly segmented, monitored, and protected from threats.",
      "implementationGuidance": "Implement network segmentation, use firewalls, monitor network traffic, implement intrusion detection, and maintain network diagrams.",
      "evidence": ["Network architecture", "Firewall rules", "Network monitoring", "Intrusion detection logs"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.13.2",
      "number": "A.13.2",
      "title": "Information transfer",
      "domain": "Operations",
      "description": "Information transfer policies and procedures shall be in place to protect the transfer of information through the use of all types of communication facilities.",
      "story": "When you email sensitive data or transfer files, you need to protect them. This control ensures proper encryption and secure transfer methods.",
      "implementationGuidance": "Define transfer policies, use encryption, implement secure channels, authenticate transfers, and log all transfers.",
      "evidence": ["Transfer policies", "Encryption implementation", "Secure channels", "Transfer logs"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.14.1",
      "number": "A.14.1",
      "title": "Security requirements of information systems",
      "domain": "Operations",
      "description": "Security requirements shall be identified and agreed prior to the development and/or implementation of information systems.",
      "story": "Security shouldn't be an afterthought. This control ensures you define security requirements before building systems, not after a breach.",
      "implementationGuidance": "Define security requirements, document in specifications, get stakeholder agreement, and integrate into development lifecycle.",
      "evidence": ["Security requirements", "System specifications", "Stakeholder agreements", "Development records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.14.2",
      "number": "A.14.2",
      "title": "Security in development and support processes",
      "domain": "Operations",
      "description": "Security shall be built into information systems throughout the entire lifecycle.",
      "story": "Secure by design means security is baked in from day one. This control ensures secure coding practices, security testing, and secure deployment.",
      "implementationGuidance": "Implement secure coding practices, conduct security testing, use secure development tools, and maintain secure configurations.",
      "evidence": ["Secure coding guidelines", "Security testing", "Development tools", "Configuration management"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.15.1",
      "number": "A.15.1",
      "title": "Information security in supplier relationships",
      "domain": "Compliance",
      "description": "Information security requirements for mitigating the risks associated with supplier's access to organizational assets shall be agreed with the supplier and documented.",
      "story": "Your vendors have access to your data. This control ensures they meet your security standards through contracts, assessments, and monitoring.",
      "implementationGuidance": "Define security requirements, include in contracts, assess vendor security, monitor compliance, and manage vendor lifecycle.",
      "evidence": ["Vendor contracts", "Security requirements", "Assessment reports", "Compliance monitoring"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.15.2",
      "number": "A.15.2",
      "title": "Supplier service delivery management",
      "domain": "Compliance",
      "description": "Organizations shall plan, implement, monitor, review and maintain information security and service delivery according to supplier agreements.",
      "story": "You can't just sign a contract and forget about it. This control ensures ongoing monitoring and management of vendor security.",
      "implementationGuidance": "Monitor service delivery, review security performance, conduct audits, manage incidents, and maintain relationships.",
      "evidence": ["Service monitoring", "Performance reviews", "Audit reports", "Incident records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.16.1",
      "number": "A.16.1",
      "title": "Management of information security incidents and improvements",
      "domain": "Operations",
      "description": "Responsibilities and procedures shall be established to ensure a quick, effective and orderly response to information security incidents.",
      "story": "When a security incident happens, you need a plan. This control ensures you can detect, respond to, and recover from security incidents quickly.",
      "implementationGuidance": "Define incident response procedures, assign responsibilities, establish communication plans, and test regularly.",
      "evidence": ["Incident response plan", "Response procedures", "Communication plans", "Test results"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.16.2",
      "number": "A.16.2",
      "title": "Responsibilities and procedures",
      "domain": "Operations",
      "description": "Management responsibilities and procedures shall be established to ensure a quick, effective and orderly response to information security incidents.",
      "story": "Who does what during an incident? This control defines roles, responsibilities, and procedures for effective incident response.",
      "implementationGuidance": "Define incident roles, establish escalation procedures, create response checklists, and train response team.",
      "evidence": ["Role definitions", "Escalation procedures", "Response checklists", "Training records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.17.1",
      "number": "A.17.1",
      "title": "Information security continuity",
      "domain": "Operations",
      "description": "Information security continuity shall be embedded in the organization's business continuity management systems.",
      "story": "What happens to security during a disaster? This control ensures security controls continue to operate even when systems are disrupted.",
      "implementationGuidance": "Integrate security into BCP, define security continuity requirements, implement redundant controls, and test regularly.",
      "evidence": ["BCP documentation", "Security continuity plan", "Redundant controls", "Test results"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.17.2",
      "number": "A.17.2",
      "title": "Redundancies",
      "domain": "Operations",
      "description": "Information processing facilities shall be implemented with redundancy sufficient to meet availability requirements.",
      "story": "If your primary server goes down, you need backups. This control ensures redundant systems to maintain availability.",
      "implementationGuidance": "Implement redundant systems, define failover procedures, test redundancy, and maintain backup facilities.",
      "evidence": ["Redundancy design", "Failover procedures", "Test results", "Backup facilities"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.18.1",
      "number": "A.18.1",
      "title": "Compliance with legal and contractual requirements",
      "domain": "Compliance",
      "description": "All relevant legislative statutory, regulatory, contractual requirements and the organization's approach to meet these requirements shall be explicitly identified, documented and kept up to date for each information system and the organization.",
      "story": "You need to comply with laws and regulations. This control ensures you know what applies to you and how you're meeting those requirements.",
      "implementationGuidance": "Identify applicable requirements, document compliance approach, monitor changes, and maintain compliance records.",
      "evidence": ["Legal requirements register", "Compliance documentation", "Monitoring records", "Audit reports"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.18.2",
      "number": "A.18.2",
      "title": "Independent review of information security",
      "domain": "Compliance",
      "description": "The organization's approach to managing information security and its implementation (i.e. control objectives, controls, policies, processes and procedures for information security) shall be reviewed independently at planned intervals or when significant changes occur.",
      "story": "You need an independent pair of eyes to review your security. This control ensures regular audits and assessments by qualified external parties.",
      "implementationGuidance": "Plan independent reviews, select qualified auditors, conduct reviews, document findings, and implement improvements.",
      "evidence": ["Review plan", "Auditor qualifications", "Review reports", "Improvement records"],
      "status": "not_started",
      "score": 0
    },
    {
      "id": "A.18.3",
      "number": "A.18.3",
      "title": "Technical compliance review",
      "domain": "Compliance",
      "description": "Information systems shall be regularly checked for compliance with the organization's information security policies and standards.",
      "story": "Are your systems actually configured according to your policies? This control ensures technical compliance through automated scanning and manual reviews.",
      "implementationGuidance": "Conduct technical reviews, use automated tools, document findings, remediate issues, and report results.",
      "evidence": ["Review procedures", "Scanning tools", "Review reports", "Remediation records"],
      "status": "not_started",
      "score": 0
    }
  ]
}

